{
    "architectures": [
      "LlamaMoeForCausalLM"
    ],
    "auto_map": {
      "AutoModelForCausalLM": "llama_moe.LlamaMoeForCausalLM",
      "AutoConfig": "llama_moe.LlamaMoeConfig"
    },
    "bos_token_id": 1,
    "eos_token_id": 2,
    "pad_token_id": 0,
    "hidden_act": "silu",
    "hidden_size": 8192,
    "initializer_range": 0.02,
    "intermediate_size": 28672,
    "max_position_embeddings": 2048,
    "model_type": "llama",
    "num_attention_heads": 64,
    "num_hidden_layers": 80,
    "num_key_value_heads": 8,
    "pretraining_tp": 2,
    "rms_norm_eps": 1e-05,
    "rope_theta": 500000,
    "rope_scaling": null,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.36.0.dev0",
    "use_cache": true,
    "vocab_size": 128256,
    "num_local_experts": 0,
    "num_experts_per_tok": 0
  }